#・Polarsとは
#Pythonのデータフレームライブラリ(pandasと同じ分類)

#特徴
#・Rustで実装されており、処理が高速のため大容量のデータの処理に向いている
#1GBのcsvファイルを読み込んだ場合、
#Polars->6秒
#Pandas->62秒
#・テーブルを表示すると、各カラムのデータ型が表示される

import polars as pl

dtypes = {
    'customer_id': str,
    'gender_cd': str,
    'postal_cd': str,
    'application_store_cd': str,
    'status_cd': str,
    'category_major_cd': str,
    'category_medium_cd': str,
    'category_small_cd': str,
    'product_cd': str,
    'store_cd': str,
    'prefecture_cd': str,
    'tel_no': str,
    'postal_cd': str,
    'street': str,
    'application_date': str,
    'birth_day': pl.Date
}

df_customer = pl.read_csv("100knocks-preprocess/docker/work/data/customer.csv", dtypes=dtypes)

print(df_customer)

#出力結果

#┌─────────┬─────────┬─────────┬────────┬───┬────────┬────────┬────────┬────────┐
#│ custome ┆ custome ┆ gender_ ┆ gender ┆ … ┆ addres ┆ applic ┆ applic ┆ status │
#│ r_id    ┆ r_name  ┆ cd      ┆ ---    ┆   ┆ s      ┆ ation_ ┆ ation_ ┆ _cd    │
#│ ---     ┆ ---     ┆ ---     ┆ str    ┆   ┆ ---    ┆ store_ ┆ date   ┆ ---    │
#│ str     ┆ str     ┆ str     ┆        ┆   ┆ str    ┆ cd     ┆ ---    ┆ str    │
#│         ┆         ┆         ┆        ┆   ┆        ┆ ---    ┆ str    ┆        │
#│         ┆         ┆         ┆        ┆   ┆        ┆ str    ┆        ┆        │
#╞═════════╪═════════╪═════════╪════════╪═══╪════════╪════════╪════════╪════════╡
#│ CS02131 ┆ 大野    ┆ 1       ┆ 女性   ┆ … ┆ 神奈川 ┆ S14021 ┆ 201509 ┆ 0-0000 │
#│ 3000114 ┆ あや子  ┆         ┆        ┆   ┆ 県伊勢 ┆        ┆ 05     ┆ 0000-0 │
#│         ┆         ┆         ┆        ┆   ┆ 原市粟 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ 窪**** ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****** ┆        ┆        ┆        │
#│ CS03761 ┆ 六角    ┆ 9       ┆ 不明   ┆ … ┆ 東京都 ┆ S13037 ┆ 201504 ┆ 0-0000 │
#│ 3000071 ┆ 雅彦    ┆         ┆        ┆   ┆ 江東区 ┆        ┆ 14     ┆ 0000-0 │
#│         ┆         ┆         ┆        ┆   ┆ 南砂** ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****** ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ **     ┆        ┆        ┆        │
#│ CS03141 ┆ 宇多田  ┆ 1       ┆ 女性   ┆ … ┆ 東京都 ┆ S13031 ┆ 201505 ┆ D-2010 │
#│ 5000172 ┆ 貴美子  ┆         ┆        ┆   ┆ 渋谷区 ┆        ┆ 29     ┆ 0325-C │
#│         ┆         ┆         ┆        ┆   ┆ 代々木 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****** ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****   ┆        ┆        ┆        │
#│ CS02881 ┆ 堀井    ┆ 1       ┆ 女性   ┆ … ┆ 神奈川 ┆ S14028 ┆ 201601 ┆ 0-0000 │
#│ 1000001 ┆ かおり  ┆         ┆        ┆   ┆ 県横浜 ┆        ┆ 15     ┆ 0000-0 │
#│         ┆         ┆         ┆        ┆   ┆ 市泉区 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ 和泉町 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****** ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****   ┆        ┆        ┆        │
#│ CS00121 ┆ 田崎    ┆ 1       ┆ 女性   ┆ … ┆ 東京都 ┆ S13001 ┆ 201706 ┆ 6-2009 │
#│ 5000145 ┆ 美紀    ┆         ┆        ┆   ┆ 大田区 ┆        ┆ 05     ┆ 0929-2 │
#│         ┆         ┆         ┆        ┆   ┆ 仲六郷 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****** ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****   ┆        ┆        ┆        │
#│ …       ┆ …       ┆ …       ┆ …      ┆ … ┆ …      ┆ …      ┆ …      ┆ …      │
#│ CS00251 ┆ 市村    ┆ 1       ┆ 女性   ┆ … ┆ 東京都 ┆ S13002 ┆ 201711 ┆ 0-0000 │
#│ 2000474 ┆ 夏希    ┆         ┆        ┆   ┆ 国分寺 ┆        ┆ 10     ┆ 0000-0 │
#│         ┆         ┆         ┆        ┆   ┆ 市光町 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****** ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****   ┆        ┆        ┆        │
#│ CS02941 ┆ 上村    ┆ 1       ┆ 女性   ┆ … ┆ 千葉県 ┆ S12029 ┆ 201503 ┆ F-2010 │
#│ 4000065 ┆ 怜奈    ┆         ┆        ┆   ┆ 浦安市 ┆        ┆ 13     ┆ 1028-F │
#│         ┆         ┆         ┆        ┆   ┆ 富士見 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****** ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****   ┆        ┆        ┆        │
#│ CS01240 ┆ 堀越 明 ┆ 0       ┆ 男性   ┆ … ┆ 神奈川 ┆ S14012 ┆ 201504 ┆ 0-0000 │
#│ 3000043 ┆         ┆         ┆        ┆   ┆ 県横浜 ┆        ┆ 06     ┆ 0000-0 │
#│         ┆         ┆         ┆        ┆   ┆ 市中区 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ 本牧間 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ 門**** ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****** ┆        ┆        ┆        │
#│ CS03351 ┆ 池谷    ┆ 1       ┆ 女性   ┆ … ┆ 神奈川 ┆ S14033 ┆ 201602 ┆ 0-0000 │
#│ 2000184 ┆ 華子    ┆         ┆        ┆   ┆ 県横浜 ┆        ┆ 06     ┆ 0000-0 │
#│         ┆         ┆         ┆        ┆   ┆ 市泉区 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ 和泉町 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****** ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****   ┆        ┆        ┆        │
#│ CS00921 ┆ 稲垣 咲 ┆ 1       ┆ 女性   ┆ … ┆ 東京都 ┆ S13009 ┆ 201504 ┆ 0-0000 │
#│ 3000022 ┆         ┆         ┆        ┆   ┆ 世田谷 ┆        ┆ 24     ┆ 0000-0 │
#│         ┆         ┆         ┆        ┆   ┆ 区駒沢 ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****** ┆        ┆        ┆        │
#│         ┆         ┆         ┆        ┆   ┆ ****   ┆        ┆        ┆        │
#└─────────┴─────────┴─────────┴────────┴───┴────────┴────────┴────────┴────────┘
